[
	{
		"id": 1,
		"colour": "green",
		"title": "Platzsy - Deine Spielplatzassistenz",
		"imageSrc": "Platzy.png",
		"description": "Platzsy - Deine Spielplatzassistenz ist ein Projekt, welches im Rahmen des Open Data Hackathons 2022/2023 in einer Gruppenarbeit entwickelt.",
		"content":[
			{
				"subtitle": "Projektbeschreibung",
				"description": "Platzsy ist eine Anwendung, die im Rahmen des Open Data Hackathons 2022/2023 entwickelt wurde, um Eltern bei der Suche nach dem optimalen Spielplatz zu unterstützen. In einem hektischen Alltag, der von Arztterminen, KiTa-Organisation und Haushaltsaufgaben geprägt ist, bleibt wenig Zeit für aufwendige Recherchen. Auch wenn man zunächst annehmen könnte, die Spieplatzauswahl sei einfach – man sucht sich eben einen Passenden in der Nähe – sieht das in der Realität völlig anders aus. Spätestens, wenn man die Bedürfnisse mehrerer Kinder unterschiedlicher Altersstufen vereinen möchte, steht man vor einer großen Herausforderung. Platzsy löst dieses Problem, indem es Eltern ermöglicht, schnell und unkompliziert den passenden Spielplatz für ihre Kinder zu finden. Schluss mit zeitraubenden Ausprobier-Manövern – Platzsy macht die Auswahl einfach und effizient."
			},
			{
				"subtitle": "Vorgehen",
				"description": "Um trotz des begrenzten Zeitrahmens eine nutzerzentrierte Gestaltung zu gewährleisten, wurde zunächst eine Analyse durchgeführt, die die Nutzergruppen Eltern, KiTas und Stadt näher betrachtete. Basierend auf einer detaillierten Beschreibung der Nutzergruppen und entsprechender Szenarien wurden Use Cases abgeleitet, priorisiert und ein Product Backlog definiert. Damit sich während der Entwicklung auf die wesentliche Funktionen fokussiert werden konnte, wurde ein MVP (Minimum Viable Product) definiert."
			},
			{
				"subtitle": "Die Anwendung",
				"description": "Die Web-App wurde mithilfe Strapi für das Backend, Vue.js für das Frontend und Vuestic für das UI-Design erstellt. Die Datenbasis bilden Daten von OpenStreetMap sowie von Gruppenmitgliedern gesammelte Daten. Die MVP enthält eine Kartenübersicht der Spielplätze und eine detaillierte Ansicht jedes Spielplatzes mit Filteroptionen und Bewertungsmöglichkeiten.",
				"media" : [
					{
					"videoSrc": "Platzsy.mp4"
					}
				]
			},
			{
				"subtitle": "Ausblick",
				"description": "Die entwickelte Web-App kann somit als Basis dienen, den Funktionsumfang über das MVP hinaus zu erweitern. Hierfür wurden bereits einige Features definiert, wie zum Beispiel eine Profilfunktion, um bereits besuchte Spielplätze zu protokollieren und Filtereinstellungen persistent zu speichern. Weiterhin wurde eine Auslastungsanzeige als relevante Funktion eingestuft, welche aufgrund fehlender Datengrundlage noch nicht umgesetzt werden konnte. Weiterhin gilt es, die Datengrundlage, welche von der Gruppe verwendet wurde, fundierter auszugestalten. So konnten im Rahmen des Hackathons nur von ca. 15 Spielplätzen detaillierte Daten (inklusive Fotos) aufbereitet werden. Die restlichen Daten wurden von OpenStreetMap integriert, sodass die Korrektheit dieser Datensätze nicht garantiert werden kann. Um den nutzerzentrierten Ansatz fortzusetzen, sollte ein Austausch mit potenziellen Nutzenden ermöglicht werden, sodass Funktionalitäten und Umsetzungen im Rahmen von User Studies getestet werden können. Ein Einstieg könnte sein, gemeinsam mit der Stadt und ausgewählten Nutzenden eine Fokusgruppe zu bilden, welche den aktuellen Stand gemeinsam weiterentwickelt."
			}
		]
	},
	{
		"id": 2,
		"colour": "yellow",
		"title": "Optimierung des Auswertungsprozesses von Co-Design Workshops: Entwicklung und Evaluation einer Systemlösung im Rahmen einer Fallstudie",
		"imageSrc": "Masterarbeit.png",
		"description": "Entwicklung eines Systemes, das Teilnehmenden auch nach dem Workshop zeigt, was mit ihren Beiträgen passiert - damit sie den Auswertungsprozess besser nachvollziehen, mitverfolgen und mitgestalten können.",
		"content": [
			{
				"subtitle": "Folgt in Kürze",
				"description": "Dieser Abschnitt befindet sich gerade noch im Aufbau"
			}
		]
	},
	{
		"id": 3,
		"colour": "red",
		"title": "Entwicklung einer Komponente zur Darstellung von Projektsteckbriefen für den PartizipationsHub - Bachelorarbeit",
		"imageSrc": "BA-Veranstaltungen.png",
		"description": "Die Komponente hat das Ziel, das digitale Monitoring von Projekten und Projektideen für Jugendliche und junge Erwachsene in Lübeck zu ermöglichen, um Ressourcen zu aktivieren und gemeinsam zu gestalten.",
		"content":[
			{
				"subtitle": "Projektbeschreibung",
				"description": "Meine Bachelorarbeit widmete sich der Entwicklung einer Komponente zur Darstellung von Projektsteckbriefen im Forschungsprojekt VernetzBar der Universität zu Lübeck. Als Basis wurde hierbei die digitale Open Source Software Decidim verwendet, welche die Einrichtung einer webbasierten Plattform speziell für die Partizipation ermöglicht. Ziel der Vernetzbar ist es, Jugendliche und jungen Erwachsene in Lübeck eine partizipative Plattform zur Verfügung zu stellen, auf der sie Informationen zu Hilfsangeboten finden können. Des Weiteren soll hiermit eine Möglichkeit geschaffen werden, dass Jugendlichen und jungen Erwachsenen schnell an Unterstützung gelangen, spielerisch neue Zielgruppen erreichen sowie über Projektsteckbriefe Ressourcen aktivieren und gemeinsam gestalten können. Dafür soll der PartizipationsHub etabliert werden. Die entwickelte Komponente beschäftigt sich mit dem digitalen Monitoring von Projektprozesse. Innerhalb dessen können strategische Planungen, partizipative Prozesse und Kommunikation zwischen Projektträgern und jungen Erwachsenen stattfinden."
			},
			{
				"subtitle": "Vorgehen",
				"description": "In der Arbeit wurden systematisch, standardisierte Anforderungen an eine solche Komponente auf Basis von Organisations-, Nutzenden-, Aufgaben- und Kontextanalyse erfasst. Die hochpriorisierten Anforderungen wurden zuerst in einem Figma Prototypen gestaltet bevor diese in einem technologisch ausgereiften Prototyps realisiert wurden. Die Evaluation zeigte, dass ein qualitativ hochwertiger Prototyp entworfen wurde, welcher als hilfreich und übersichtlich wahrgenommen wurde. Abschließend wurde die Weiterentwicklung sowie die Integration der Komponente in ein Gesamtsystem und Folgestudien zur Evaluation der Anwendung vorgeschlagen und diskutiert."
			},
			{
				"subtitle": "Analyse",
				"description":"Um die Rahmenbedingungen und Einflüsse für das Projekt zu erfassen, wurde eine umfassende Analyse gemäß des menschzentrierten Gestaltungsprozesses durchgeführt. Hierzu wurde eine Literaturrecherche sowie Interviews mit potentielle Teilnehmende und Veranstaltenden durchgeführt. Die Analyse gliederte sich in mehrere Teilbereiche: Zunächst wurde eine Organisationsanalyse durchgeführt, um die verschiedenen Phasen eines Projekts besser zu verstehen. Anschließend wurden die Nutzenden in der Nutzeranalyse spezifiziert, wobei sich die Arbeit auf die Altersgruppe von 18 bis 25 Jahren konzentrierte. Hier wurde die aktuelle Situation sowie Herausforderungen mit einbezogen. Des Weiteren wurden eine Kontext- und Aufgabenanalyse durchgeführt.",
				"media":[
					{
					"imageSrc": "Aufgaben.jpg"
					}
				]
			},
			{
				"subtitle": "Interface Gestaltung",
				"description":"Für die Interface-Gestaltung wurde eine Komponente mit verschiedenen Ansichten entwickelt, basierend auf der in den Analyse erarbeiteten Anforderungen. Im ersten Schritt wurden Skizzen angefertigt. Da für die gesamte Anwendung der VernetzBar noch keine Designsprache vorlag, wurde ein einheitlicher Stil inklusive Farbschema entwickelt, um ein konsistentes Erscheinungsbild zu gewährleisten. Die Entwürfe wurden in Figma unter Berücksichtigung der festgelegten Designsprache umgesetzt.",
				"media": [
					{
						"imageSrc": "BA-Skizzen.png"
					},
					{
						"imageSrc": "Figma-BA-comp.png"
					},
					{
						"imageSrc": "Figma-BA.png"
					}
				]
			},
			{
				"subtitle": "Die Anwendung",
				"description": "Die Webanwendung basiert auf der Open-Source-Software Decidim, die mit Ruby on Rails entwickelt wird. Decidim verwendet SASS als CSS-Präprozessor mit der SCSS-Syntax. Zusätzlich nutzt die Anwendung das CSS-Framework Tailwind CSS. Der Prototyp enthält die Ansichten Projektübersicht, Projektideen und Für Dich inklusive Filteroptionen. Ebenso sind Detailansichten der Projekte und Ideen enthalten, welche Interaktion wie teilnehmen, folgen und bewerten ermöglichen.",
				"media":[
					{
					"imageSrc": "BA-Ansichten.png"
					}
				]
			}
		]
	}
]